/*
    网络的相关概念
        网络通信
            1.概念∶两台设备之间通过网络实现数据传输
            2.网络通信∶将数据通过网络从一台设备传输到另一台设备
            3.java.net包下提供了一系列的类或接口，供程序员使用，完成网络通信
        网络
            1.概念∶两台或多台设备通过一定物理设备连接起来构成了网络
            2.根据网络的覆盖范围不同，对网络进行分类
                局域网覆盖范围最小，仅仅覆盖一个教室或一个机房
                城域网覆盖范围较大，可以覆盖一个城市
                广域网覆盖范围最大，可以覆盖全国，甚至全球，万维网是广域网的代表
        ip 地址
            1.概念∶用于唯一标识网络中的每台计算机/主机
            2.查看ip地址 ip config
            3. ip地址的表示形式∶点分十进制 xx.xx.xx
            4.每一个十进制数的范围0~255
            5.ip地址的组成=网络地址+主机地址，比如∶192.168.16.69
            6.iIPv6是互联网工程任务组设计的用于替代IPv4的下一代IP协议，其地址数量号称可以为全世界的每一粒沙子编上一个地址
            7.由于IPv4最大的问题在于网络地址资源有限，严重制约了互联网的应用和发展。
              IPv6格力的使用，不仅能解决网络地址资源数量的问题，而且也解决了多种接入设备连入互联网的障碍
* */
public class Web {
    public static void main(String[] args) {

    }
}
