/*
    数据结构和算法的介绍
        数据结构和算法的关系
            数据data结构(structure)是一门研究组织数据方式的学科，有了编程语言也就有了数据结构.
            学好数据结构可以编写出更加漂亮,更加有效率的代码。
            要学习好数据结构就要多多考虑如何将生活中遇到的问题,用程序去实现解决.
            程序=数据结构＋算法
            数据结构是算法的基础,换言之，想要学好算法，需要把数据结构学到位。
    数据结构包括：线性结构和非线性结构
        线性结构
           线性结构作为最常用的数据结构，其特点是数据元素之间存在一对一的线性关系
           线性结构有两种不同的存储结构，即顺序存储结构和链式存储结构。顺序存储的线性表称为顺序表，顺序表中的存储元素是连续的
           链式存储的线性表称为链表，链表中的存储元素不一定是连续的，元素节点中存放数据元素以及相邻元素的地址信息
           线性结构常见的有：数组、队列、链表和栈
        非线性结构
           非线性结构包括：二维数组，多维数组，广义表，树结构，图结构
* */


public class Introduce {
    public static void main(String[] args) {

    }
}
