public class Func {
    public static void main(String[] args) {

    }
    /*
        什么是函数
            函数在计算机语言的使用中贯穿始终，函数的作用是什么呢?它可以把我们经常使用的代码封装起来，需要的时候直接调用即可。
            这样既提高了代码效率，又提高了可维护性。在SQL中我们也可以使用函数对检索出来的数据进行函数操作。
            使用这些函数，可以极大地提高用户对数据库的管理效率。
        不同DBMS函数的差异
            我们在使用SQL语言的时候，不是直接和这门语言打交道，而是通过它使用不同的数据库软件，即DBMS。
            DBMS之间的差异性很大，远大于同一个语言不同版本之间的差异。
            实际上，只有很少的函数是被DBMS同时支持的。
            比如，大多数DBMS使用(I)或者（+）来做拼接符，而在MysQL中的字符串拼接函数为concat()。
            大部分DBMS会有自己特定的函数，这就意味着采用SQL函数的代码可移植性是很差的，因此在使用函数的时候需要特别注意。
        MySQL的内置函数及分类
            MysQL提供了丰富的内置函数，这些函数使得数据的维护与管理更加方便，能够更好地提供数据的分析与统计功能，
            在一定程度上提高了开发人员进行数据分析与统计的效率。
            MysQL提供的内置函数从实现的功能角度可以分为数值函数、字符串函数、日期和时间函数、流程控制函数、加密与解密函数、获取MySQL信息函数、聚合函数等。
            这些丰富的内置函数分为两类:单行函数、聚合函数（或分组函数)
        单行函数
            操作数据对象
            接受参数返回一个结果
            只对一行进行变换
            每行返回一个结果
            可以嵌套
            参数可以是一列或一个值
        多行函数
            操作数据对象
            接受多个参数 返回一个结果
            对多行进行变换
            不可以嵌套
     */
}
